[
  {
    "id": 1,
    "name": "Grilled Chicken Salad",
    "country": "United States",
    "desc": "A light and healthy grilled chicken salad with mixed greens and a lemon vinaigrette.",
    "image": "file:///android_asset/images/image01.png",
    "instructions": "Grill the chicken breast seasoned with salt and pepper. Slice the grilled chicken and place it on a bed of mixed greens. Drizzle with lemon juice and olive oil, then sprinkle with salt and pepper to taste. Serve immediately.",
    "video_link": "https://www.youtube.com/watch?v=v1VUg6r4yFA",
    "ingredients": ["Chicken Breast", "Mixed Greens", "Lemon Juice"],
    "fitness_advice": "Elevate your Grilled Chicken Salad by using lean chicken breast, grilling it to retain nutrients and flavor. Bulk up on greens like kale and spinach for fiber and vitamins. Lightly dress with olive oil and lemon juice for a refreshing, low-calorie option. This meal is perfect for post-workout recovery, providing essential protein and nutrients to support your fitness journey.",
    "process_steps": [
      "<font color='red'>The chicken needs to be marinated for about 30 minutes.</font><br/>",
      "1. Marinate chicken breast with olive oil, salt, pepper, and lemon juice for 30 minutes.<br/>",
      "2. Grill the chicken on a preheated grill for about 6-7 minutes on each side until cooked through.<br/>",
      "3. Chop lettuce, cucumber, and tomato, and place them in a large bowl.<br/>",
      "4. Slice the grilled chicken and place it on top of the salad; toss to combine."
    ],
    "category": "Low Fat",
    "allergy": "None",
    "protein": 30.0,
    "fat": 10.0,
    "carbs": 15.0,
    "nutrients": ["Vitamin A", "Vitamin C"]
  },
  {
    "id": 2,
    "name": "Steamed Fish with Vegetables",
    "country": "China",
    "desc": "A delicate and flavorful steamed fish served with fresh vegetables.",
    "image": "file:///android_asset/images/image02.png",
    "instructions": "Place the fish fillet on a steaming tray. Add sliced carrots and broccoli florets around the fish. Steam for 8-10 minutes until the fish is cooked through and vegetables are tender. Serve with a squeeze of lemon juice.",
    "video_link": "https://www.youtube.com/watch?v=Nc50dc2q6oE",
    "ingredients": ["White Fish Fillet", "Carrots", "Broccoli"],
    "fitness_advice": "Opt for Steamed Fish with Vegetables for a lean, protein-rich meal that's gentle on the stomach. Choose a fish high in omega-3s like salmon or trout. Pair with a variety of steamed veggies for added fiber, vitamins, and minerals. Season with herbs and spices for flavor instead of heavy sauces. This dish is ideal for promoting weight loss and supporting overall health.",
    "process_steps": [
      "1. Clean the fish and place ginger and garlic on top.<br/>",
      "2. Slice the carrot and place it with the green peas in a steamer.<br/>",
      "3. Steam for 15 minutes, then drizzle with soy sauce before serving."
    ],
    "category": "Low Fat",
    "allergy": "Fish",
    "protein": 25.0,
    "fat": 5.0,
    "carbs": 10.0,
    "nutrients": ["Omega-3", "Vitamin D"]
  },
  {
    "id": 3,
    "name": "Oven-Baked Falafel",
    "country": "Middle East",
    "desc": "A healthier version of falafel, baked in the oven until golden and crispy.",
    "image": "file:///android_asset/images/image03.png",
    "instructions": "Preheat the oven to 375°F. Blend chickpeas, garlic, parsley, cumin, and salt in a food processor until a coarse mixture forms. Shape into small balls and place on a baking sheet. Bake for 20-25 minutes until golden brown, flipping halfway through.",
    "video_link": "https://www.youtube.com/watch?v=S8FbQQQqtE4",
    "ingredients": ["Chickpeas", "Garlic", "Parsley"],
    "fitness_advice": "Embrace Oven-Baked Falafel for a healthier twist on a classic snack. Baked instead of fried, they're lower in fat and calories. Load up on veggies like lettuce, tomatoes, and cucumbers in your wrap or pita for extra fiber and nutrients. Choose whole wheat pita for added fiber. Falafel is a great source of plant-based protein, supporting muscle recovery and growth.",
    "process_steps": [
      "<font color='red'>Chickpeas should be soaked overnight</font><br/>",
      "1. Soak chickpeas overnight and drain. Blend with onion, garlic, cilantro, and cumin until smooth.<br/>",
      "2. Add salt and flour, and mix well.<br/>",
      "3. Shape into small balls, place on a baking sheet, brush with olive oil, and bake at 180°C (350°F) for 30 minutes."
    ],
    "category": "Baby Food",
    "allergy": "None",
    "protein": 12.0,
    "fat": 6.0,
    "carbs": 30.0,
    "nutrients": ["Fiber", "Iron"]
  },
  {
    "id": 4,
    "name": "Vegan Buddha Bowl",
    "country": "United States",
    "desc": "A balanced vegan bowl filled with grains, vegetables, and a flavorful dressing.",
    "image": "file:///android_asset/images/image04.png",
    "instructions": "Cook the quinoa according to package instructions. Roast the chickpeas with olive oil and spices. Assemble the bowl with quinoa, chickpeas, avocado, kale, and other vegetables. Drizzle with tahini dressing and serve.",
    "video_link": "https://www.youtube.com/watch?v=fj3EKszZD9E",
    "ingredients": ["Quinoa", "Chickpeas", "Avocado"],
    "fitness_advice": "Indulge in a Vegan Buddha Bowl for a nutrient-dense, plant-based meal. Fill your bowl with a variety of veggies like roasted sweet potatoes, quinoa, kale, and avocado for a mix of complex carbs, healthy fats, and fiber. Top with a tahini or peanut sauce for flavor. This meal is perfect for fueling your workouts and promoting overall health and wellness.",
    "process_steps": [
      "<font color='red'>Brown rice and chickpeas (or canned) need to be cooked in advance.</font><br/>",
      "1. Cook brown rice and chickpeas (or use canned).<br/>",
      "2. Slice kale and carrot, and chop avocado.<br/>",
      "3. Combine all ingredients in a bowl and drizzle with tahini sauce."
    ],
    "category": "Vegan",
    "allergy": "None",
    "protein": 12.0,
    "fat": 20.0,
    "carbs": 45.0,
    "nutrients": ["Vitamin A", "Vitamin C", "Fiber"]
  },
  {
    "id": 5,
    "name": "Vegan Tofu Stir-Fry",
    "country": "China",
    "desc": "A quick and healthy tofu stir-fry with mixed vegetables.",
    "image": "file:///android_asset/images/image05.png",
    "instructions": "Press and cube the tofu. Stir-fry tofu in a pan until golden. Add chopped vegetables and stir-fry for 5-7 minutes. Add soy sauce and other seasonings to taste. Serve with rice or noodles.",
    "video_link": "https://www.youtube.com/watch?v=Ecq2svvSWXc",
    "ingredients": ["Tofu", "Broccoli", "Bell Peppers"],
    "fitness_advice": "Go for a Vegan Tofu Stir-Fry for a protein-packed, meatless meal. Choose firm tofu for its meaty texture and high protein content. Stir-fry with a variety of colorful veggies like bell peppers, broccoli, and mushrooms for added nutrients and fiber. Use a small amount of oil and flavor with soy sauce or tamari for a delicious, guilt-free dish that supports your fitness goals.",
    "process_steps": [
      "1. Cut tofu into cubes and pan-fry until golden on all sides.<br/>",
      "2. Add sliced bell peppers and carrot, stir-fry for 5 minutes.<br/>",
      "3. Add minced garlic and soy sauce, and stir-fry for another 2 minutes."
    ],
    "category": "Vegan",
    "allergy": "Soy",
    "protein": 18.0,
    "fat": 15.0,
    "carbs": 30.0,
    "nutrients": ["Calcium", "Iron"]
  },
  {
    "id": 6,
    "name": "Vegan Stuffed Bell Peppers",
    "country": "United States",
    "desc": "Colorful bell peppers stuffed with a flavorful quinoa and vegetable mix.",
    "image": "file:///android_asset/images/image06.png",
    "instructions": "Cook quinoa according to package instructions. Cut the tops off the bell peppers and remove seeds. Mix cooked quinoa with black beans, corn, and spices. Stuff the peppers with the mixture and bake at 375°F for 25-30 minutes.",
    "video_link": "https://www.youtube.com/watch?v=eZRZk1x_AG8",
    "ingredients": ["Bell Peppers", "Quinoa", "Black Beans"],
    "fitness_advice": "Embrace Vegan Stuffed Bell Peppers for a flavorful, nutrient-dense meal. Stuff bell peppers with a mix of quinoa, veggies like onions, mushrooms, and spinach, and a vegan cheese alternative. Bake until tender for a satisfying, low-fat dish. The fiber from the peppers and quinoa will keep you full, supporting your weight loss and fitness journey.",
    "process_steps": [
      "<font color='red'>Rice should be cooked ahead of time.</font><br/>",
      "1. Cut the tops off the bell peppers and remove the seeds.<br/>",
      "2. Mix rice, black beans, corn, and tomato sauce, seasoning with salt and spices.<br/>",
      "3. Fill the bell peppers with the mixture and bake at 180°C (350°F) for 30 minutes."
    ],
    "category": "Vegan",
    "allergy": "None",
    "protein": 10.0,
    "fat": 8.0,
    "carbs": 40.0,
    "nutrients": ["Vitamin C", "Fiber"]
  },
  {
    "id": 7,
    "name": "Vegetarian Lasagna",
    "country": "Italy",
    "desc": "A rich and hearty vegetarian lasagna packed with vegetables, cheese, and marinara sauce.",
    "image": "file:///android_asset/images/image07.png",
    "instructions": "Cook the lasagna noodles according to package instructions. In a baking dish, layer the noodles with ricotta cheese, sautéed vegetables, and marinara sauce. Repeat layers and top with mozzarella cheese. Bake at 375°F for 40 minutes until the top is golden and bubbly.",
    "video_link": "https://www.youtube.com/watch?v=nVY6Ze5VYsk",
    "ingredients": ["Lasagna Noodles", "Ricotta Cheese", "Marinara Sauce"],
    "fitness_advice": "Opt for Vegetarian Lasagna for a hearty, satisfying meal without meat. Use whole wheat lasagna noodles for added fiber. Layer with a variety of veggies like spinach, eggplant, and zucchini, and top with a rich tomato sauce and vegan cheese. Portion control is key; enjoy a moderate serving to balance indulgence with your fitness goals.",
    "process_steps": [
      "<font color='red'>Lasagna noodles need to be cooked beforehand.</font><br/>",
      "1. Cook lasagna noodles according to package instructions.</br/>",
      "2. Layer noodles, spinach, ricotta cheese, and tomato sauce in a baking dish.<br/>",
      "3. Top with mozzarella cheese and bake at 175°C (350°F) for 45 minutes."
    ],
    "category": "Vegetarian",
    "allergy": "Gluten, Dairy",
    "protein": 18.0,
    "fat": 25.0,
    "carbs": 60.0,
    "nutrients": ["Vitamin A", "Calcium", "Iron"]
  },
  {
    "id": 8,
    "name": "Mushroom Risotto",
    "country": "Italy",
    "desc": "A creamy and savory risotto made with mushrooms and Arborio rice.",
    "image": "file:///android_asset/images/image08.png",
    "instructions": "In a large pan, sauté the mushrooms until golden brown. Add Arborio rice and cook for 2 minutes. Gradually add vegetable broth, one ladle at a time, stirring constantly until the rice is creamy and cooked. Stir in Parmesan cheese and serve hot.",
    "video_link": "https://www.youtube.com/watch?v=ju9H1RlYNxk",
    "ingredients": ["Arborio Rice", "Mushrooms", "Vegetable Broth"],
    "fitness_advice": "Indulge in Mushroom Risotto for a creamy, savory meal. Use brown rice instead of Arborio for added fiber and nutrients. Sautée mushrooms with garlic and herbs for flavor, and add a touch of vegetable broth for moisture. Enjoy in moderation, as risotto can be high in calories. Pair with a side salad for a balanced, fitness-friendly meal.",
    "process_steps": [
      "<font color='red'>Vegetable broth should be prepared in advance.</font><br/>",
      "1. Sauté onion and garlic, then add mushrooms and cook until golden.<br/>",
      "2. Stir in Arborio rice and cook for 2 minutes, gradually adding vegetable broth until absorbed.<br/>",
      "3. Stir in Parmesan cheese before serving."
    ],
    "category": "Vegetarian",
    "allergy": "None",
    "protein": 10.0,
    "fat": 15.0,
    "carbs": 50.0,
    "nutrients": ["Vitamin D", "Fiber"]
  },
  {
    "id": 9,
    "name": "Eggplant Parmesan",
    "country": "Italy",
    "desc": "Classic eggplant slices breaded and baked with marinara sauce and melted cheese.",
    "image": "file:///android_asset/images/image09.png",
    "instructions": "Slice the eggplant and coat in breadcrumbs. Arrange on a baking sheet and bake at 400°F for 20 minutes. Layer the baked eggplant in a dish with marinara sauce and mozzarella cheese. Bake for an additional 15 minutes until the cheese is melted and bubbly.",
    "video_link": "https://www.youtube.com/watch?v=bZTI9VGQKNw",
    "ingredients": ["Eggplant", "Breadcrumbs", "Mozzarella Cheese"],
    "fitness_advice": "Try Eggplant Parmesan for a delicious, vegetarian twist on a classic dish. Bake sliced eggplant instead of frying for a healthier alternative. Layer with a marinara sauce and a sprinkle of vegan Parmesan cheese. Serve with a side of roasted veggies or a green salad to balance the dish and support your fitness journey.",
    "process_steps": [
      "<font color='red'>Prepare flour, eggs, and breadcrumbs beforehand.</font><br/>",
      "1. Slice eggplant and coat in flour, beaten eggs, and breadcrumbs.<br/>",
      "2. Pan-fry until golden on both sides.<br/>",
      "3. Layer eggplant, tomato sauce, and mozzarella cheese in a baking dish, then bake at 175°C (350°F) for 30 minutes."
    ],
    "category": "Vegetarian",
    "allergy": "Gluten, Dairy",
    "protein": 12.0,
    "fat": 20.0,
    "carbs": 35.0,
    "nutrients": ["Vitamin C", "Fiber"]
  },
  {
    "id": 10,
    "name": "Chicken & Quinoa Salad",
    "country": "United States",
    "desc": "A refreshing salad combining grilled chicken, quinoa, and fresh veggies.",
    "image": "file:///android_asset/images/image10.png",
    "instructions": "Cook the quinoa as per package instructions. Grill the chicken breast until cooked through and slice it thinly. In a large bowl, combine the quinoa, chicken, chopped bell peppers, cucumbers, and a light lemon vinaigrette. Toss well and serve chilled.",
    "video_link": "https://www.youtube.com/watch?v=FFpGzDuWmKA",
    "ingredients": ["Quinoa", "Chicken Breast", "Bell Peppers"],
    "fitness_advice": "Opt for Chicken & Quinoa Salad for a protein-rich, nutrient-dense meal. Use grilled chicken breast for lean protein and quinoa for complex carbs and fiber. Mix in fresh veggies like tomatoes, cucumbers, and red onion for added vitamins and minerals. Lightly dress with olive oil and lemon juice for a refreshing, low-calorie salad that supports your fitness goals.",
    "process_steps": [
      "<font color='red'>Chicken and quinoa should be cooked in advance.</font><br/>",
      "1. Cook chicken breast and quinoa.<br/>",
      "2. Combine all ingredients, drizzle with olive oil, and season with salt."
    ],
    "category": "Protein Rich",
    "allergy": "None",
    "protein": 30.0,
    "fat": 15.0,
    "carbs": 40.0,
    "nutrients": ["Vitamin B", "Fiber", "Iron"]
  },
  {
    "id": 11,
    "name": "Chickpea & Spinach Curry",
    "country": "India",
    "desc": "A hearty and flavorful curry made with chickpeas and fresh spinach.",
    "image": "file:///android_asset/images/image11.png",
    "instructions": "In a large pot, sauté onions and garlic until soft. Add chickpeas, spices, and coconut milk. Simmer for 10 minutes, then add fresh spinach. Cook for an additional 5 minutes until the spinach is wilted. Serve hot with rice or naan.",
    "video_link": "https://www.youtube.com/watch?v=wsvfA0YOLUs",
    "ingredients": ["Chickpeas", "Spinach", "Coconut Milk"],
    "fitness_advice": "Indulge in Chickpea & Spinach Curry for a flavorful, plant-based meal. Chickpeas are a great source of protein and fiber, supporting muscle recovery and satiety. Pair with nutrient-dense spinach and flavor with a homemade curry sauce. Serve over brown rice or quinoa for a complete, balanced meal that supports your fitness journey.",
    "process_steps": [
      "<font color='red'>Prepare spices and coconut milk ahead of time.</font><br/>",
      "1. Sauté onion and garlic, then add curry powder and cook until fragrant.<br/>",
      "2. Stir in chickpeas and coconut milk, simmer for 5 minutes.<br/>",
      "3. Add spinach and cook until wilted. Serve hot with rice or naan."
    ],
    "category": "Vegan",
    "allergy": "None",
    "protein": 15.0,
    "fat": 10.0,
    "carbs": 35.0,
    "nutrients": ["Iron", "Vitamin A"]
  },
  {
    "id": 12,
    "name": "Grilled Salmon with Veggies",
    "country": "United States",
    "desc": "A simple and healthy grilled salmon dish served with a side of mixed vegetables.",
    "image": "file:///android_asset/images/image12.png",
    "instructions": "Season the salmon fillets with salt, pepper, and lemon juice. Grill the salmon for 5-6 minutes on each side until cooked. In the meantime, toss asparagus and zucchini with olive oil and grill for 3-4 minutes. Serve the salmon with the grilled veggies on the side.",
    "video_link": "https://www.youtube.com/watch?v=-mMxDYa1tmo",
    "ingredients": ["Salmon Fillets", "Asparagus", "Zucchini"],
    "fitness_advice": "Go for Grilled Salmon with Veggies for a lean protein and veggie-packed meal. Salmon is rich in omega-3 fatty acids, supporting heart health and inflammation reduction. Grill salmon with herbs and lemon for a simple, flavorful preparation. Serve alongside grilled or roasted veggies like asparagus, zucchini, and bell peppers for a well-rounded, fitness-friendly dish.",
    "process_steps": [
      "1. Marinate salmon with olive oil, salt, and pepper.<br/>",
      "2. Grill salmon and vegetables until cooked through."
    ],
    "category": "Protein Rich",
    "allergy": "Fish",
    "protein": 35.0,
    "fat": 20.0,
    "carbs": 5.0,
    "nutrients": ["Omega-3", "Vitamin D"]
  },
  {
    "id": 13,
    "name": "Turkey Chili",
    "country": "United States",
    "desc": "A hearty and comforting chili made with lean ground turkey and beans.",
    "image": "file:///android_asset/images/image13.png",
    "instructions": "In a large pot, brown the ground turkey with chopped onions. Add kidney beans, diced tomatoes, and chili powder. Simmer for 30 minutes, stirring occasionally. Serve hot with your favorite toppings like cheese, avocado, or sour cream.",
    "video_link": "https://www.youtube.com/watch?v=1g7stN3Oy70",
    "ingredients": ["Ground Turkey", "Kidney Beans", "Tomatoes"],
    "fitness_advice": "Warm up with Turkey Chili for a hearty, protein-packed meal. Use lean ground turkey to keep calories in check. Load up on beans, tomatoes, and peppers for added fiber, vitamins, and minerals. Serve over brown rice or quinoa for a complete meal that supports muscle recovery and overall health during your fitness journey.",
    "process_steps": [
      "<font color='red'>Black beans and spices should be ready.</font><br/>",
      "1. Sauté onion, then add ground turkey and cook until browned.<br/>",
      "2. Stir in black beans, tomatoes, and chili powder, simmer for 30 minutes."
    ],
    "category": "Protein Rich",
    "allergy": "None",
    "protein": 28.0,
    "fat": 15.0,
    "carbs": 30.0,
    "nutrients": ["Vitamin A", "Iron", "Fiber"]
  }
]
